app/controllers/links_controller.rb

SELECT * FROM "links" WHERE ((link ~* 'sdfasdfasdfsadf' or description ~* 'sdfasdfasdfsadf') and tag = '0')
SELECT * FROM "links"
---
  def search

    begin
      @criteria = params[:criteria]

      # searching with the default text comparisons
      result = Link.find(:all, :conditions => "content like '%#{@criteria}%'")  #Yml.search_hash(@criteria)
      @result = []
      result.each do |res|

SELECT * FROM "users" WHERE (isnotificationsubscribed = true)
DELETE FROM "notificationlinks" WHERE "id" = 7
---
  def sendnotification
    Notificationlink.find(:all).each do |link|
      #User.find(:all, :conditions => "isnotificationsubscribed = true").each do |user|
      User.find(:all).each do |user|
        UserMailer.deliver_linknotification(link,user,current_user)
      end
      link.destroy

INSERT INTO "tags" ("name", "description", "created_at", "updated_at") VALUES('general', NULL, '2010-12-08 15:58:25.177982', '2010-12-08 15:58:25.177982') RETURNING "id"
SELECT "tags".id FROM "tags" WHERE ("tags"."name" = 'general') LIMIT 1
INSERT INTO "links" ("link", "description", "tag", "createdby", "created_at", "updated_at") VALUES('http://google.com', 'a sample link', 0, 0, '2010-12-06 07:07:57.774883', '2010-12-06 07:07:57.774883') RETURNING "id"
INSERT INTO "notificationlinks" ("link", "created_at", "updated_at") VALUES('http://gmail.com', '2011-01-11 08:37:35.808725', '2011-01-11 08:37:35.808725') RETURNING "id"
---
  def create
    @link = Link.new(params[:link])
    newtag = params[:newtag]
    tag = params[:tag]
    if newtag != ''
      tag = Tag.new
      tag.name = newtag
      if tag.save
        @link.tag = tag.id
      else
        Tag.find(:all, :conditions => "name == #{newtag}").each do |t|
          @link.tag = t
        end
      end
    else
      @link.tag = tag
    end
    notification = Notificationlink.new
    notification.link = @link[:link]
    notification.save

INSERT INTO "tags" ("name", "description", "created_at", "updated_at") VALUES('tag1', NULL, '2010-12-06 15:10:14.875991', '2010-12-06 15:10:14.875991') RETURNING "id"
---
  def addtag
    @tag = Tag.new
    @tag.name = params[:name]
    @tag.description = params[:description]
    @tag.name
    if @tag.save