app/controllers/scrabcontent_controller.rb

  def index
    client = IndexTank::Client.new('http://:vnNWPQglltomb3@xba3.api.indextank.com')
    index = client.indexes('idx')
    counter = 1
    Link.find(:all, :conditions => "content = '' or content = NULL").each do |lnk|
        @result = Net::HTTP.get(URI.parse(lnk.link))
        ic = Iconv.new('UTF-8//IGNORE', 'UTF-8')
        @result = ic.iconv(@result + ' ')[0..-2]
        @result.force_encoding("UTF-8")
        @result =Sanitize.clean(@result)
        @result = @result.gsub(/\r\n?/, "")
        @result = @result.gsub(/\n?/, "")
        @result = @result.gsub(/\r?/, "")
        lnk.content = @result
        lnk.save
---
SELECT "links".id FROM "links" WHERE ("links"."link" = 'http://msdnrss.thecoderblogs.com/2011/02/project-server-2010-take-care-changing-custom-fields-to-allow-multiple-values/' AND "links".id <> 3) LIMIT 1
UPDATE "links" SET "content" = 'Database Error Error establishing a database connection ', "updated_at" = '2011-03-25 13:45:44.998800' WHERE "id" = 4