app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "crypted_password", "password_salt", "persistence_token", "isnotificationsubscribed", "created_at", "updated_at", "identity_url") VALUES('santhoshonet@itxsolutionsindia.com', 'santhoshonet@itxsolutionsindia.com', '5fc2888eb00f4c6ada92d306745e047265cecfef4cbe7c35c53b1bf39abf9d810d878bc71ae7bff3e8ff6d30ddffa66eddda7a58f228cf8033d7849a8ad177cf', 'Bw2gUakWb2qEvvNfNb5M', '17a81f4ec077ecdc95e350160e16014fcf2b2848cc706529378f3338c884cd1d061ffbaf160f0ebbe5124bd99e446aa66c86b2adcdfbb52929b4b54192502369', NULL, '2011-02-07 12:11:46.700028', '2011-02-07 12:11:46.700028', NULL) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    @user.username = @user.email
    @user.isnotificationsubscribed = true
    if @user.save